JayHeng/imxrt-blhost/rt1180/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitKPPPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: N14, peripheral: KPP, signal: 'kpp_row, 5', pin_signal: GPIO_AD_16, software_input_on: Enable, pull_up_down_config: Pull_Up, open_drain: Disable, slew_rate: Fast}
  - {pin_num: L12, peripheral: KPP, signal: 'kpp_col, 5', pin_signal: GPIO_AD_17, software_input_on: Enable, pull_up_down_config: Pull_Up, open_drain: Disable}
  - {pin_num: L13, peripheral: KPP, signal: 'kpp_row, 4', pin_signal: GPIO_AD_18, software_input_on: Enable, pull_up_down_config: Pull_Up, open_drain: Disable}
  - {pin_num: K13, peripheral: KPP, signal: 'kpp_col, 4', pin_signal: GPIO_AD_19, software_input_on: Enable, pull_up_down_config: Pull_Up, open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitKPPPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitKPPPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_KPP_ROW05,            /* GPIO_AD_16 is configured as KPP_ROW05 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_16 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_KPP_COL05,            /* GPIO_AD_17 is configured as KPP_COL05 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_17 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_18_KPP_ROW04,            /* GPIO_AD_18 is configured as KPP_ROW04 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_18 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_19_KPP_COL04,            /* GPIO_AD_19 is configured as KPP_COL04 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_19 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_16_KPP_ROW05,            /* GPIO_AD_16 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_17_KPP_COL05,            /* GPIO_AD_17 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_18_KPP_ROW04,            /* GPIO_AD_18 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_19_KPP_COL04,            /* GPIO_AD_19 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Force ibe off Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitGPTPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: M11, peripheral: GPT1, signal: 'gpt_compare, 1', pin_signal: GPIO_AD_14}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitGPTPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitGPTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_GPT1_COMPARE1,        /* GPIO_AD_14 is configured as GPT1_COMPARE1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLASHPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: B7, peripheral: FLEXSPI2, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_AON_22, software_input_on: Enable}
  - {pin_num: B6, peripheral: FLEXSPI2, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_AON_23, software_input_on: Enable}
  - {pin_num: A6, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_AON_24, software_input_on: Enable}
  - {pin_num: A5, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_AON_25, software_input_on: Enable}
  - {pin_num: B4, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_AON_26, software_input_on: Enable}
  - {pin_num: B3, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_AON_27, software_input_on: Enable}
  - {pin_num: C4, peripheral: FLEXSPI2, signal: FLEXSPI_A_DQS, pin_signal: GPIO_AON_21, software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

