JayHeng/imxrt-blhost/rt1180/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitQTMRPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: B2, peripheral: TMR1, signal: 'TIMER, 0', pin_signal: GPIO_EMC_B1_18}
  - {pin_num: E3, peripheral: TMR1, signal: 'TIMER, 1', pin_signal: GPIO_EMC_B1_13}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitQTMRPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitQTMRPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  BLK_CTRL_WAKEUPMIX->QTIMER_CTRL1 = ((BLK_CTRL_WAKEUPMIX->QTIMER_CTRL1 &
    (~(BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL_MASK | BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL_MASK))) /* Mask bits to zero which are setting */
      | BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR0_INPUT_SEL(0x00U) /* QTIMER1 TMR0 input select: Input from IOMUX */
      | BLK_CTRL_WAKEUPMIX_QTIMER_CTRL1_QTIMER1_TMR1_INPUT_SEL(0x00U) /* QTIMER1 TMR1 input select: Input from IOMUX */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_QTIMER1_TIMER1,   /* GPIO_EMC_B1_13 is configured as QTIMER1_TIMER1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_18_QTIMER1_TIMER0,   /* GPIO_EMC_B1_18 is configured as QTIMER1_TIMER0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_I2CPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXIO1, signal: 'IO, 12', pin_signal: GPIO_EMC_B1_12, software_input_on: Enable, pull_down_pull_up_config: Pull_Up, open_drain: Disable}
  - {pin_num: E3, peripheral: FLEXIO1, signal: 'IO, 13', pin_signal: GPIO_EMC_B1_13, identifier: '', software_input_on: Enable, pull_down_pull_up_config: Pull_Up,
    open_drain: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_I2CPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIO_I2CPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 is configured as FLEXIO1_FLEXIO12 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_12 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13,  /* GPIO_EMC_B1_13 is configured as FLEXIO1_FLEXIO13 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_EMC_B1_13 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_13_FLEXIO1_FLEXIO13,  /* GPIO_EMC_B1_13 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PU
                                                 Open Drain Field: Disabled */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_PINOUTPUTPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: D3, peripheral: FLEXIO1, signal: 'IO, 11', pin_signal: GPIO_EMC_B1_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_PINOUTPUTPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIO_PINOUTPUTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_11_FLEXIO1_FLEXIO11,  /* GPIO_EMC_B1_11 is configured as FLEXIO1_FLEXIO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFLEXIO_PININPUTPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXIO1, signal: 'IO, 12', pin_signal: GPIO_EMC_B1_12}
  - {pin_num: E3, peripheral: RGPIO2, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B1_13, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFLEXIO_PININPUTPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFLEXIO_PININPUTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration of flexio_pin on GPIO_EMC_B1_13 (pin E3) */
  rgpio_pin_config_t flexio_pin_config = {
      .pinDirection = kRGPIO_DigitalOutput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B1_13 (pin E3) */
  RGPIO_PinInit(RGPIO2, 13U, &flexio_pin_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_12_FLEXIO1_FLEXIO12,  /* GPIO_EMC_B1_12 is configured as FLEXIO1_FLEXIO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_13_GPIO2_IO13,       /* GPIO_EMC_B1_13 is configured as GPIO2_IO13 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


