JayHeng/imxrt-blhost/rt1180/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI3CPins:
- options: {createDeInit: 'true', callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: D6, peripheral: I3C1, signal: i3c_scl, pin_signal: GPIO_AON_16, drive_strength: Normal, slew_rate: Slow}
  - {pin_num: B8, peripheral: I3C1, signal: i3c_sda, pin_signal: GPIO_AON_15, drive_strength: Normal, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3CPins, assigned for the Cortex-M33 core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI3CPins(void) {
	  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_AON_15_I3C1_SDA,            /* GPIO_AON_15 is configured as I3C1_SDA */
	      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_15 */
	  IOMUXC_SetPinMux(
	      IOMUXC_GPIO_AON_16_I3C1_SCL,            /* GPIO_AON_16 is configured as I3C1_SCL */
	      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AON_16 */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_AON_15_I3C1_SDA,            /* GPIO_AON_15 PAD functional properties : */
	      0x0DU);                                 /* Slew Rate Field: Fast Slew Rate
	                                                 Drive Strength Field: high driver
	                                                 Pull / Keep Select Field: Pull Enable
	                                                 Pull Up / Down Config. Field: Weak pull up
	                                                 Open Drain Field: Disabled */
	  IOMUXC_SetPinConfig(
	      IOMUXC_GPIO_AON_16_I3C1_SCL,            /* GPIO_AON_16 PAD functional properties : */
	      0x0DU);                                 /* Slew Rate Field: Fast Slew Rate
	                                                 Drive Strength Field: high driver
	                                                 Pull / Keep Select Field: Pull Enable
	                                                 Pull Up / Down Config. Field: Weak pull up
	                                                 Open Drain Field: Disabled */
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI3CPins_deinit, assigned for the Cortex-M33 core.
 * Description   : This is a de-initialization function for 'BOARD_InitI3CPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI3CPins_deinit(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc2);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B8) */
  rgpio_pin_config_t gpio1_pinB8_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B8) */
  RGPIO_PinInit(RGPIO1, 15U, &gpio1_pinB8_config);
  /* Configures GPIO pin interrupt/DMA request on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_15 (pin B8) */
  RGPIO_SetPinInterruptConfig(RGPIO1, 15U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_16 (pin D6) */
  rgpio_pin_config_t gpio1_pinD6_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_16 (pin D6) */
  RGPIO_PinInit(RGPIO1, 16U, &gpio1_pinD6_config);
  /* Configures GPIO pin interrupt/DMA request on IOMUXC_AON_SW_MUX_CTL_PAD_GPIO_AON_16 (pin D6) */
  RGPIO_SetPinInterruptConfig(RGPIO1, 16U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_15_GPIO1_IO15,          /* GPIO_AON_15 is configured as GPIO1_IO15 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AON_16_GPIO1_IO16,          /* GPIO_AON_16 is configured as GPIO1_IO16 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_15_GPIO1_IO15,          /* GPIO_AON_15 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AON_16_GPIO1_IO16,          /* GPIO_AON_16 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high driver
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
